<a href="https://colab.research.google.com/github/willrosa93/teste01/blob/main/Comandos_SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# Criar database
CREATE DATABASE <nome>;

# Mostrar databases
SHOW DATABASES;

# Deletar databases
DROP DATABASE <nome>

SyntaxError: ignored

In [ ]:
# Criar tabelas
CREATE TABLE <nome> (
    id INT PRIMARY KEY,
    titulo VARCHAR(100)

)

# Inserir valores na tabela
INSERT INTO <nome> (id, titulo)
VALUES
  (1, 'Teste1'),
  (2, 'Teste2')

# Deletando tabela
DROP TABLE <nome>

In [ ]:
from os import SF_SYNC
# Tipos de dados
# de texto
CHAR(x) - Textos de 0 a 255 caracteres
VARCHAR(x) - Textos de 0 a 65535 caracteres
Tinytext(x) - Textos até 255 caracteres
Mediumtext - Textos até 16777215 caracteres
Obs.: CHAR e VARCHAR aceitam números e caracteres específicos

# de números
BIT(x) - 1 a 64 caracteres
Tinyint(x) - 1 a 255 caracteres
Bool - 0 é falso, outros valores são verdadeiros
Int(x) - Valores entre -2147483648 a 2147483648

# de datas
DATE - Formato yyyy-mm-dd
DATETIME - Formato yyyy-mm-dd hh:mm:ss
TIMESTAMP - Formato igual ao DATETIME, porém, apenas entre os anos 1970 a 2038
Obs.: Datas são inseridas enter ""

In [ ]:
# CRUD

# C
CREATE DATABASE ou TABLE

# R (Ler)
SELECT * FROM <tabela>

# U
UPDATE <tabela>
  SET <tabela> = <Valor>
  WHERE <condicao>

# D
DELETE FROM <tabela> WHERE <condicao>

In [ ]:
# Operadores
## de comparação
WHERE <coluna> > 10 # Maior que
WHERE <coluna> < 10 # Menor que
WHERE <coluna> = 10 # Igual a
WHERE <coluna> >= 10 # Maior ou igual
WHERE <coluna> <= 10 # Menor ou igual
WHERE <coluna> <> 10 # Diferente de, retorna NULL se um dos parâmetros for nulo
WHERE <coluna> != 10 # Diferente de, retorna NULL se um dos parâmetros for nulo

# Seleção ente intervalo
SELECT * FROM <tabela>
WHERE <coluna> BETWEEN <valor_inicial> AND <valor_final>

# Seleção por meio de um padrão
SELECT * FROM <tabela>
WHERE <coluna> LIKE 'o%'; # Retornará dados que inicial com 'o'
WHERE <coluna> LIKE '%o'; # Retornará dados que terminam com 'o'
WHERE <coluna> LIKE '%o%'; # Retornará dados que contenham 'o' em qualquer lugar
WHERE <coluna> LIKE '_o%'; # Retornará dados que contenham 'o' no segundo caractere
WHERE <coluna> NOT LIKE '_o%'; # Retornará dados que não contenham 'o' no segundo caractere

# Seleção entre conjunto de valores específicos
WHERE <coluna> IN ('10','11','12') # Retornará dados que contenham 10, 11 e 12
WHERE <coluna> NOT IN ('10','11','12') # Retornará dados que não contenham 10, 11 e 12

# Seleção de variações de valores
SELECT DISTINCT <coluna> FROM <tabela>

## Lógicos
# Recebe duas condições, retornará resultados que atendam as duas
WHERE <coluna1> = 10 AND <coluna2> = 1

# Recebe duas condições, retornará resultados que atendam pelo menos uma
WHERE <coluna1> = 10 OR <coluna2> = 1

# Inverte uma cláusula
WHERE NOT <coluna> = 'Verde'

In [ ]:
# Classificação em ordem crescente (por detault) de registros
SELECT <id>, <cidade> FROM <tabela>
WHERE <coluna> = '10'
ORDER BY <cidade>, <id> DESC # DESC significa que a ordenação será decrescente

In [ ]:
# Limitar resultados
SELECT * FROM <tabela>
ORDER BY <salary>
LIMIT 10 # Resultará apenas os 10 menores salários

In [ ]:
## Funções
SELECT MAX(salary) FROM salaries # Retorna o maior valor de uma coluna
SELECT MIN(salary) FROM salaries # Retorna o menor valor de uma coluna
SELECT COUNT(id) FROM salaries WHERE salary > 1000 # Retorna o número de ids que recebem salário maior que 1000
SELECT AVG(salary) FROM salaries # Retorna a média dos salários
SELECT SUM(salary) FROM salaries # Retorna a soma dos salários
SELECT CEIL(salary) FROM salaries # Arredonda para cima
SELECT FLOOR(salary) FROM salaries # Arredonda para baixo

In [ ]:
# Renomear colunas
SELECT SUM(salary) AS soma_salarios FROM salaries

In [ ]:
## CONSTRAINTS - Regras que determinam como os campos serão preenchidos
# Campo não pode ser nulo
NOT NULL

# Garante que todos os valores em uma coluna serão distintos
UNIQUE

# Identificador de um registro na tabela
PRIMARY KEY # Só pode ser adicionada em uma coluna da tabela, geralmente é o ID

# Adiciona 1 a todo registro
AUTO_INCREMENT

# Ligação entre tabelas
FOREIGN KEY

# Adiciona índice a uma coluna, isso prioriza uma coluna e pode agilizar as consultas
INDEX # Para remover um index utilize: DROP INDEX

Exempo:

CREATE TABLE pessoas (
      id INT PRIMARY KEY AUTO_INCREMENTE NOT NULL,
      nome VARCHAR(30),
      email VARCHAR(255) UNIQUE,
      documento_id INT NOT NULL
      FOREIGN KEY (documento_id) REFERENCES documentos(id)
);

CREATE INDEX index_documento_id;
REMOVE INDEX index_documento_id;

In [ ]:
## Consultas que envolvem duas ou mais tabelas que tenham relações entre si
# Resulta nas colunas que fazem relação entre as tabelas
SELECT e.id, e.nome, p.id, p.nome
FROM estudantes AS e
INNER JOIN professores AS p
ON e.nome = p.nome;

# Resulta de todos os dados da tabela da esquerda (do FROM) e das necessárias da direita
SELECT e.id, e.nome, p.id, p.nome
FROM estudantes AS e
LEFT JOIN professores AS p
ON e.nome = p.nome;

# Resulta de todos os dados da tabela da direita e das necessárias da esquerda (do FROM)
SELECT e.id, e.nome, p.id, p.nome
FROM estudantes AS e
RIGHT JOIN professores AS p
ON e.nome = p.nome;

In [ ]:
## Agrupamentos e Subqueries
# Combina resultados dois ou mais selects. Obs.: As colunas precisam ter o mesmo nome, seu uso não traz dados duplicados
SELECT pais FROM clientes
UNION
SELECT pais FROM fornecedores;

# Variação do UNION é o UNION ALL, a diferença é que com o UNION ALL serão retornados valores duplicados se houverem

# Agrupamento de colunas e checagem de quantidade de determinados elementos
SELECT <genero>, COUNT(genero) AS 'Qtd por gênero' FROM employees
GROUP BY <genero>

----------------------------------------------------------------------------------
Resultado:
Gênero               Qtd por gênero
M                    179973
F                    120054

# Alternativa ao WHERE, o HAVING
SELECT title, COUNT(title) AS titulos FROM titles
HAVING COUNT(title) > 100000 # com WHERE daria erro no filtro
GROUP BY title

# Por vezes é preciso criar uma query dentro de uma outra, para isto usaremos as subqueries
SELECT first_name, (
    SELECT SUM(salary) FROM salaries
    WHERE employees.emp_no = salaries.emp_no
) AS soma_salario
FROM employees
ORDER BY emp_no DESC; # Para usar subqueries é preciso relacionar a consulta interna com a externa, semelhante ao que é feito com JOIN

# Conferir se existe algum registro em algum registro em alguma subquery, podendo retornar resultados se existir algum de fato
SELECT empo_no, first_name, last_name (
    SELECT SUM(salary) FROM salaries
    WHERE employees.emp_no = salaries.emp_no
) AS soma_salario
FROM employees
WHERE EXISTS (
    SELECT salary
    FROM salaries
    WHERE employees.emp_no = salaries.emp_no
    HAVING SUM(salary) > 2000000
);

# ANY, retorna resultados que recebem TRUE da subquery
SELECT fist_name
FROM employees
WHERE emp_no = ANY(
    SELECT emp_no
    FROM salaries
    WHERE salary > 150000
) # Essa consulta retornará os nomes de quem ganha mais que 150000

In [ ]:
## Funções de string
# Retorna o número de caracteres de uma string
SELECT first_name FROM actor
WHERE CHAR_LENGHT(documento) = 14 # Retornará nomes de quem tem documento com 14 caracteres, ou seja, CNPJs

# Concatenar duas ou mais strings
SELECT CONCAT (first_name, " ", last_name) AS nome_completo
FROM sakila.actor #sakila foi o schema criado anteriormente

# Concatenar duas ou mais strings apontando um separador
SELECT CONCAT_WS (' ',first_name, last_name) AS nome_completo
FROM sakila.actor #sakila foi o schema criado anteriormente

# Formatar um número determinando o número de casas decimais
SELECT customer_id, amount, FORMAT(amount,5) AS amount_ajustado FROM payment # na coluna amount_ajustado teremos o número com 5 casas decimais

# Retornar a posição do caractere ou string que estamos buscando
SELECT email. INSTR(email,'@') FROM customer

# Retorna letras minusculas
SELECT first_name, last_name, LCASE(CONCAT(firt_name,' ',last_name)) AS nome_completo FROM customer

# Extrai quantidade de caracteres definido da esquerda para direita
SELECT title, LEFT(title,8) FROM filme WHERE filme_id = 1

# Extrai quantidade de caracteres definido da direita para esquerda
SELECT title, RIGHT(title,8) FROM filme WHERE filme_id = 1

# Alterar parte de string
SELECT REPLACE (gender, "Action", "Action & Adventure") FROM category

# Extrai uma string a partir de dois indices, inicio e fim
SELECT SUBSTR(last_update,9,2) AS dia, SUBSTR(last_update,6,2) AS "mês", SUBSTR(last_update,1,4) ano FROM actor
---------------------------------------------------------------------------------------------------------------
Resultado
last_update               dia   mês   ano
2006-02-15                15    02    2006

# Retorna todas as letras em maisculo
SELECT UCASE(description) FROM film

In [ ]:
## Funções de datas
# Adicionar ou remover uma quantidade de dias, meses ou anos de uma data
SELECT last_update,
ADDDATE(last_update, '5 DAYS') AS "adiciona 5 dias",
ADDDATE(last_update, INTERVAL 2 MONTHS) AS "adiciona 2 meses",
ADDDATE(last_update, INTERVAL -3 MONTHS) AS "remove 2 meses",
ADDDATE(last_update, INTERVAL 1 YEAR) AS "adiciona 1 ano"

# Calcular diferença entre duas datas
SELECT DATEDIFF (ADDDATE(last_update, INTERVAL -2 YEAR), last_update) FROM actor

# Adicionar ou remover um tempo de uma data
SELECT last_update, ADDTIME(last_update,'5 03:00:00') FROM actor # Adicionamos 5 dias e 3 horas

# Formatar datas com padrão indicado
SELECT DATE_FORMAT(last_update, '%y') ano,
DATE_FORMAT(last_update, '%d/%m/%y') data_formatada,
last_update
FROM actor

# Retorna o dia da data utilizada
SELECT last_update, DAY(last_update) AS dia,
DAY(ADDTIME(last_update, '5 00:00:00') AS adicionar_5_dias)
FROM actor

# Retorna o dia da semana de uma data
SELECT last_update, DAYOFWEEK(last_update) FROM actor

# Retorna o dia do ano em uma data
SELECT last_update, DAYOFYEAR(last_update) FROM actor

# Retorna a semana do ano de uma data
SELECT last_update, WEEKOFYEAR(last_update) FROM actor

# Extrai o mês de uma data
SELECT last_update, MONTH(last_update) FROM actor

# Extrai o ano de uma data
SELECT last_update, YEAR(last_update) FROM actor

In [ ]:
# Avaliar condições e retorna uma das várias expressões possíveis
# No SELECT
   SELECT nomeProduto, precoProduto,
 CASE nomeProduto
 WHEN 'margarina' THEN (precoProduto)*0.9
 WHEN 'vinagre' THEN (precoProduto)*0.8
 WHEN 'vinho tinto' THEN (precoProduto)*0.7
 ELSE 'Sem desconto disponível'
 END AS produtosComDesconto
 From produtos;

 # No UPDATE
 UPDATE teste.contratos c
SET codigo_tipo_contrato =
	CASE
		WHEN p.documento LIKE '___________' THEN '10'
		WHEN p.documento LIKE '______________' THEN '20'
		ELSE codigo_tipo_contrato
	END
FROM teste.pessoas p
WHERE c.identificador_cliente = p.identificador